_org/android系统加载资源文件源码分析.org
#+STARTUP: showall
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:t ^:nil
#+LAYOUT: post
#+AUTHOR: tiankai
#+DATE: 2019-06-02 日 21:50
#+TITLE: Android系统加载资源文件源码分析
#+DESCRIPTION: Android
#+TAGS: Android
#+CATEGORIES: Android

* Android 如何加载 asset 中的资源文件

在 Android 开发时, 如果想要加载 assets 文件夹下面的文件, 可以使用如下的方式对文
件进行加载

 #+begin_src java
private Bitmap getImageFromAssetsFile(String fileName) {
    Bitmap image = null;
    AssetManager am = getResources().getAssets();
    if (am == null)
    {
        return null;
    }
    try
    {
        InputStream is = am.open(fileName);
        image = BitmapFactory.decodeStream(is);
        is.close();
    }
    catch (IOException e)
    {
        e.printStackTrace();
    }
    return image;
}
 #+end_src
首先获取到 AssetManager 对象,然后使用 AssetManager对象对文件进行 open,获取到
InputStream 了,接下来就可以对得到的数据进行读取了.

总结下来 Android 系统对资源文件的处理,主要氛围三步:
1.创建/获取 AssetManager
2.使用 AssetManager 打开需要加载的资源文件
3.读取资源文件的内容,然后按照自己的要求进行处理
在上面的三个步骤中,第二和第二步是最重要的, 这两个操作在源码时如何实现的呢?接下来
我们会分别对上面的两步进行分析
