_posts/2019-06-02-android系统加载资源文件源码分析.html
---
date: 2019-06-02
tags: 
- Android
author: tiankai
layout: post
title: Android系统加载资源文件源码分析
excerpt: Android
categories: 
- Android
---

<div id="outline-container-org848faae" class="outline-2">
<h2 id="org848faae">Android 如何加载 asset 中的资源文件</h2>
<div class="outline-text-2" id="text-org848faae">
<p>
在 Android 开发时, 如果想要加载 assets 文件夹下面的文件, 可以使用如下的方式对文
件进行加载
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">Bitmap</span> <span style="color: #bc6ec5; font-weight: bold;">getImageFromAssetsFile</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">fileName</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">Bitmap</span> <span style="color: #7590db;">image</span> = <span style="color: #a45bad;">null</span>;
    <span style="color: #ce537a; font-weight: bold;">AssetManager</span> <span style="color: #7590db;">am</span> = getResources<span style="color: #bc6ec5;">()</span>.getAssets<span style="color: #bc6ec5;">()</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>am == <span style="color: #a45bad;">null</span><span style="color: #bc6ec5;">)</span>
    <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">null</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">try</span>
    <span style="color: #bc6ec5;">{</span>
        <span style="color: #ce537a; font-weight: bold;">InputStream</span> <span style="color: #7590db;">is</span> = am.open<span style="color: #2d9574;">(</span>fileName<span style="color: #2d9574;">)</span>;
        image = BitmapFactory.decodeStream<span style="color: #2d9574;">(</span>is<span style="color: #2d9574;">)</span>;
        is.close<span style="color: #2d9574;">()</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">IOException</span> <span style="color: #7590db;">e</span><span style="color: #bc6ec5;">)</span>
    <span style="color: #bc6ec5;">{</span>
        e.printStackTrace<span style="color: #2d9574;">()</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> image;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
首先获取到 AssetManager 对象,然后使用 AssetManager对象对文件进行 open,获取到
InputStream 了,接下来就可以对得到的数据进行读取了.
</p>

<p>
总结下来 Android 系统对资源文件的处理,主要氛围三步:
1.创建/获取 AssetManager
2.使用 AssetManager 打开需要加载的资源文件
3.读取资源文件的内容,然后按照自己的要求进行处理
在上面的三个步骤中,第二和第二步是最重要的, 这两个操作在源码时如何实现的呢?接下来
我们会分别对上面的两步进行分析
</p>
</div>
</div>
