_posts/2019-06-02-android系统加载资源文件源码分析.html
<div id="outline-container-org8174456" class="outline-2">
<h2 id="org8174456">Android 加载资源文件并创建 InputStream 的过程</h2>
<div class="outline-text-2" id="text-org8174456">
<p>
Android 系统加载资源文件主要使用的系统方法是 AssetManager 类, 这个类定义在*
/frameworks/base/core/java/android/content/res/AssetManager.java *这个类中定义
了加载资源文件的操作.其中比较重要的函数 open 的定义如下:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #9f8766;">/**</span>
<span style="color: #9f8766;">     * Open an asset using ACCESS_STREAMING mode.  This provides access to</span>
<span style="color: #9f8766;">     * files that have been bundled with an application as assets -- that is,</span>
<span style="color: #9f8766;">     * files placed in to the "assets" directory.</span>
<span style="color: #9f8766;">     *</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@param</span><span style="color: #9f8766;"> fileName The name of the asset to open.  This name can be</span>
<span style="color: #9f8766;">     *                 hierarchical.</span>
<span style="color: #9f8766;">     *</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@see</span><span style="color: #9f8766;"> #open(String, int)</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@see</span><span style="color: #9f8766;"> #list</span>
<span style="color: #9f8766;">     */</span>
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">InputStream</span> <span style="color: #bc6ec5; font-weight: bold;">open</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">fileName</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">IOException</span> <span style="color: #4f97d7;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> open<span style="color: #bc6ec5;">(</span>fileName, ACCESS_STREAMING<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7;">}</span>

    <span style="color: #9f8766;">/**</span>
<span style="color: #9f8766;">     * Open an asset using an explicit access mode, returning an InputStream to</span>
<span style="color: #9f8766;">     * read its contents.  This provides access to files that have been bundled</span>
<span style="color: #9f8766;">     * with an application as assets -- that is, files placed in to the</span>
<span style="color: #9f8766;">     * "assets" directory.</span>
<span style="color: #9f8766;">     *</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@param</span><span style="color: #9f8766;"> fileName The name of the asset to open.  This name can be</span>
<span style="color: #9f8766;">     *                 hierarchical.</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@param</span><span style="color: #9f8766;"> accessMode Desired access mode for retrieving the data.</span>
<span style="color: #9f8766;">     *</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@see</span><span style="color: #9f8766;"> #ACCESS_UNKNOWN</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@see</span><span style="color: #9f8766;"> #ACCESS_STREAMING</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@see</span><span style="color: #9f8766;"> #ACCESS_RANDOM</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@see</span><span style="color: #9f8766;"> #ACCESS_BUFFER</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@see</span><span style="color: #9f8766;"> #open(String)</span>
<span style="color: #9f8766;">     * </span><span style="color: #a45bad;">@see</span><span style="color: #9f8766;"> #list</span>
<span style="color: #9f8766;">     */</span>
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">InputStream</span> <span style="color: #bc6ec5; font-weight: bold;">open</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">fileName</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">accessMode</span><span style="color: #4f97d7;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">IOException</span> <span style="color: #4f97d7;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">synchronized</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">this</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span><span style="color: #a45bad;">!</span>mOpen<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
                <span style="color: #4f97d7; font-weight: bold;">throw</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">RuntimeException</span><span style="color: #67b11d;">(</span><span style="color: #2d9574;">"Assetmanager has been closed"</span><span style="color: #67b11d;">)</span>;
            <span style="color: #2d9574;">}</span>
            <span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #7590db;">asset</span> = openAsset<span style="color: #2d9574;">(</span>fileName, accessMode<span style="color: #2d9574;">)</span>;
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>asset != <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
                <span style="color: #ce537a; font-weight: bold;">AssetInputStream</span> <span style="color: #7590db;">res</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">AssetInputStream</span><span style="color: #67b11d;">(</span>asset<span style="color: #67b11d;">)</span>;
                incRefsLocked<span style="color: #67b11d;">(</span>res.hashCode<span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span>;
                <span style="color: #4f97d7; font-weight: bold;">return</span> res;
            <span style="color: #2d9574;">}</span>
        <span style="color: #bc6ec5;">}</span>
        <span style="color: #4f97d7; font-weight: bold;">throw</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">FileNotFoundException</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Asset file: "</span> + fileName<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
其中 openAsset 的源码如下:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">native</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #bc6ec5; font-weight: bold;">openAsset</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">fileName</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">accessMode</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>
<p>
通过上面的定义,发现 openAsset 是一个 native 方法,所以需要对这个方法在 native 层
对应的方法进行追踪.通过查找源码发现 openAsset 的定义在*/frameworks/base/core/jni/android_util_AssetManager.cpp*
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">location: /frameworks/base/core/jni/android_util_AssetManager.cpp</span>
<span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">jlong</span> <span style="color: #bc6ec5; font-weight: bold;">android_content_AssetManager_openAsset</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span>* <span style="color: #7590db;">env</span>, <span style="color: #ce537a; font-weight: bold;">jobject</span> <span style="color: #7590db;">clazz</span>,
                                                <span style="color: #ce537a; font-weight: bold;">jstring</span> <span style="color: #7590db;">fileName</span>, <span style="color: #ce537a; font-weight: bold;">jint</span> <span style="color: #7590db;">mode</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">AssetManager</span>* <span style="color: #7590db;">am</span> = assetManagerForJavaObject<span style="color: #bc6ec5;">(</span>env, clazz<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>am == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
    <span style="color: #bc6ec5;">}</span>

    ALOGV<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"openAsset in %p (Java object %p)\n"</span>, am, clazz<span style="color: #bc6ec5;">)</span>;

    <span style="color: #ce537a; font-weight: bold;">ScopedUtfChars</span> <span style="color: #7590db;">fileName8</span><span style="color: #bc6ec5;">(</span>env, fileName<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>fileName8.c_str<span style="color: #2d9574;">()</span> == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        jniThrowException<span style="color: #2d9574;">(</span>env, <span style="color: #2d9574;">"java/lang/IllegalArgumentException"</span>, <span style="color: #2d9574;">"Empty file name"</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> -<span style="color: #a45bad;">1</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mode != <span style="color: #a45bad;">Asset</span>::ACCESS_UNKNOWN &amp;&amp; mode != <span style="color: #a45bad;">Asset</span>::ACCESS_RANDOM
        &amp;&amp; mode != <span style="color: #a45bad;">Asset</span>::ACCESS_STREAMING &amp;&amp; mode != <span style="color: #a45bad;">Asset</span>::ACCESS_BUFFER<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        jniThrowException<span style="color: #2d9574;">(</span>env, <span style="color: #2d9574;">"java/lang/IllegalArgumentException"</span>, <span style="color: #2d9574;">"Bad access mode"</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> -<span style="color: #a45bad;">1</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #ce537a; font-weight: bold;">Asset</span>* <span style="color: #7590db;">a</span> = am-&gt;open<span style="color: #bc6ec5;">(</span>fileName8.c_str<span style="color: #2d9574;">()</span>, <span style="color: #2d9574;">(</span><span style="color: #a45bad;">Asset</span>::<span style="color: #ce537a; font-weight: bold;">AccessMode</span><span style="color: #2d9574;">)</span>mode<span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>a == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        jniThrowException<span style="color: #2d9574;">(</span>env, <span style="color: #2d9574;">"java/io/FileNotFoundException"</span>, fileName8.c_str<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> -<span style="color: #a45bad;">1</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">printf("Created Asset Stream: %p\n", a);</span>

    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">reinterpret_cast</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">jlong</span><span style="color: #bc6ec5;">&gt;(</span>a<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>

</pre>
</div>
<p>
从上面的代码中可以看到,核心的逻辑实在 native 层的 AssetManager 的 open 函数,也就
是说 Java 层和 Native 层分别都有 AssetManager 类的定义.native 层的 AssetManager
中的 open 的定义如下:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">location: /frameworks/base/libs/androidfw/AssetManager.cpp</span>
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * Open an asset.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * The data could be;</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *  - In a file on disk (assetBase + fileName).</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *  - In a compressed file on disk (assetBase + fileName.gz).</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *  - In a Zip archive, uncompressed or compressed.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * It can be in a number of different directories and Zip archives.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * The search order is:</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *  - [appname]</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    - locale + vendor</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    - "default" + vendor</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    - locale + "default"</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    - "default + "default"</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *  - "common"</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    - (same as above)</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * To find a particular file, we have to try up to eight paths with</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * all three forms of data.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * We should probably reject requests for "illegal" filenames, e.g. those</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * with illegal characters or "../" backward relative paths.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #ce537a; font-weight: bold;">Asset</span>* <span style="color: #a45bad;">AssetManager</span>::<span style="color: #bc6ec5; font-weight: bold;">open</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">fileName</span>, <span style="color: #ce537a; font-weight: bold;">AccessMode</span> <span style="color: #7590db;">mode</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">AutoMutex</span> <span style="color: #7590db;">_l</span><span style="color: #bc6ec5;">(</span>mLock<span style="color: #bc6ec5;">)</span>;

    LOG_FATAL_IF<span style="color: #bc6ec5;">(</span>mAssetPaths.size<span style="color: #2d9574;">()</span> == <span style="color: #a45bad;">0</span>, <span style="color: #2d9574;">"No assets added to AssetManager"</span><span style="color: #bc6ec5;">)</span>;


    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mCacheMode != CACHE_OFF &amp;&amp; <span style="color: #a45bad;">!</span>mCacheValid<span style="color: #bc6ec5;">)</span>
        loadFileNameCacheLocked<span style="color: #bc6ec5;">()</span>;

    <span style="color: #ce537a; font-weight: bold;">String8</span> <span style="color: #7590db;">assetName</span><span style="color: #bc6ec5;">(</span>kAssetsRoot<span style="color: #bc6ec5;">)</span>;
    assetName.appendPath<span style="color: #bc6ec5;">(</span>fileName<span style="color: #bc6ec5;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * For each top-level asset path, search for the asset.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     */</span>

    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">i</span> = mAssetPaths.size<span style="color: #bc6ec5;">()</span>;
    <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #bc6ec5;">(</span>i &gt; <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        i--;
        ALOGV<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Looking for asset '%s' in '%s'\n"</span>,
                assetName.string<span style="color: #67b11d;">()</span>, mAssetPaths.itemAt<span style="color: #67b11d;">(</span>i<span style="color: #67b11d;">)</span>.path.string<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span>;
        <span style="color: #ce537a; font-weight: bold;">Asset</span>* <span style="color: #7590db;">pAsset</span> = openNonAssetInPathLocked<span style="color: #2d9574;">(</span>assetName.string<span style="color: #67b11d;">()</span>, mode, mAssetPaths.itemAt<span style="color: #67b11d;">(</span>i<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>pAsset != <span style="color: #a45bad;">NULL</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">return</span> pAsset != kExcludedAsset ? pAsset : <span style="color: #a45bad;">NULL</span>;
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">NULL</span>;
<span style="color: #4f97d7;">}</span>

</pre>
</div>
<p>
接下来的关键的函数是openNonAssetInPathLocked, 其中assetName为需要加载的资源文件
的名称, mode 是加载资源文件的模式, mAssetPaths 是一个 vector,里面包含当前 APK 能
够进行资源加载的路径.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">location: /frameworks/base/libs/androidfw/AssetManager.cpp</span>
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * Open a non-asset file as if it were an asset, searching for it in the</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * specified app.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * Pass in a NULL values for "appName" if the common app directory should</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * be used.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #ce537a; font-weight: bold;">Asset</span>* <span style="color: #a45bad;">AssetManager</span>::<span style="color: #bc6ec5; font-weight: bold;">openNonAssetInPathLocked</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">fileName</span>, <span style="color: #ce537a; font-weight: bold;">AccessMode</span> <span style="color: #7590db;">mode</span>,
    <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">asset_path</span>&amp; <span style="color: #7590db;">ap</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">Asset</span>* <span style="color: #7590db;">pAsset</span> = <span style="color: #a45bad;">NULL</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">look at the filesystem on disk */</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>ap.type == kFileTypeDirectory<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #ce537a; font-weight: bold;">String8</span> <span style="color: #7590db;">path</span><span style="color: #2d9574;">(</span>ap.path<span style="color: #2d9574;">)</span>;
        path.appendPath<span style="color: #2d9574;">(</span>fileName<span style="color: #2d9574;">)</span>;

        pAsset = openAssetFromFileLocked<span style="color: #2d9574;">(</span>path, mode<span style="color: #2d9574;">)</span>;

        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>pAsset == <span style="color: #a45bad;">NULL</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">try again, this time with ".gz" */</span>
            path.append<span style="color: #67b11d;">(</span><span style="color: #2d9574;">".gz"</span><span style="color: #67b11d;">)</span>;
            pAsset = openAssetFromFileLocked<span style="color: #67b11d;">(</span>path, mode<span style="color: #67b11d;">)</span>;
        <span style="color: #2d9574;">}</span>

        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>pAsset != <span style="color: #a45bad;">NULL</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">printf("FOUND NA '%s' on disk\n", fileName);</span>
            pAsset-&gt;setAssetSource<span style="color: #67b11d;">(</span>path<span style="color: #67b11d;">)</span>;
        <span style="color: #2d9574;">}</span>

    <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">look inside the zip file */</span>
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #ce537a; font-weight: bold;">String8</span> <span style="color: #7590db;">path</span><span style="color: #2d9574;">(</span>fileName<span style="color: #2d9574;">)</span>;

        <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">check the appropriate Zip file */</span>
        <span style="color: #ce537a; font-weight: bold;">ZipFileRO</span>* <span style="color: #7590db;">pZip</span> = getZipFileLocked<span style="color: #2d9574;">(</span>ap<span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>pZip != <span style="color: #a45bad;">NULL</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">printf("GOT zip, checking NA '%s'\n", (const char*) path);</span>
            <span style="color: #ce537a; font-weight: bold;">ZipEntryRO</span> <span style="color: #7590db;">entry</span> = pZip-&gt;findEntryByName<span style="color: #67b11d;">(</span>path.string<span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span>;
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>entry != <span style="color: #a45bad;">NULL</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">printf("FOUND NA in Zip file for %s\n", appName ? appName : kAppCommon);</span>
                pAsset = openAssetFromZipLocked<span style="color: #b1951d;">(</span>pZip, entry, mode, path<span style="color: #b1951d;">)</span>;
                pZip-&gt;releaseEntry<span style="color: #b1951d;">(</span>entry<span style="color: #b1951d;">)</span>;
            <span style="color: #67b11d;">}</span>
        <span style="color: #2d9574;">}</span>

        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>pAsset != <span style="color: #a45bad;">NULL</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">create a "source" name, for debug/display */</span>
            pAsset-&gt;setAssetSource<span style="color: #67b11d;">(</span>
                    createZipSourceNameLocked<span style="color: #b1951d;">(</span><span style="color: #a45bad;">ZipSet</span>::getPathName<span style="color: #4f97d7;">(</span>ap.path.string<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>, String8<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">""</span><span style="color: #4f97d7;">)</span>,
                                                String8<span style="color: #4f97d7;">(</span>fileName<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>;
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">return</span> pAsset;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
因为我们的资源文件是在 apk 中,所以我们是走下面的分支, 首先创建 ZipEntryRO 对象,
然后通过需要加载的资源文件的名称获取到需要加载的 entry,然后调用
openAssetFromZipLocked 进行加载.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">location: /frameworks/base/libs/androidfw/AssetManager.cpp</span>
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * Given an entry in a Zip archive, create a new Asset object.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * If the entry is uncompressed, we may want to create or share a</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * slice of shared memory.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #ce537a; font-weight: bold;">Asset</span>* <span style="color: #a45bad;">AssetManager</span>::<span style="color: #bc6ec5; font-weight: bold;">openAssetFromZipLocked</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">ZipFileRO</span>* <span style="color: #7590db;">pZipFile</span>,
    <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">ZipEntryRO</span> <span style="color: #7590db;">entry</span>, <span style="color: #ce537a; font-weight: bold;">AccessMode</span> <span style="color: #7590db;">mode</span>, <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">String8</span>&amp; <span style="color: #7590db;">entryName</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">Asset</span>* <span style="color: #7590db;">pAsset</span> = <span style="color: #a45bad;">NULL</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #dc752f;">TODO</span><span style="color: #2aa1ae; background-color: #292e34;">: look for previously-created shared memory slice?</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">method</span>;
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">uncompressedLen</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">printf("USING Zip '%s'\n", pEntry-&gt;getFileName());</span>

    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">pZipFile-&gt;getEntryInfo(entry, &amp;method, &amp;uncompressedLen, &amp;compressedLen,</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//    </span><span style="color: #2aa1ae; background-color: #292e34;">&amp;offset);</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>pZipFile-&gt;getEntryInfo<span style="color: #2d9574;">(</span>entry, &amp;method, &amp;uncompressedLen, <span style="color: #a45bad;">NULL</span>, <span style="color: #a45bad;">NULL</span>,
            <span style="color: #a45bad;">NULL</span>, <span style="color: #a45bad;">NULL</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
    <span style="color: #bc6ec5;">{</span>
        ALOGW<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"getEntryInfo failed\n"</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">NULL</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #ce537a; font-weight: bold;">FileMap</span>* <span style="color: #7590db;">dataMap</span> = pZipFile-&gt;createEntryFileMap<span style="color: #bc6ec5;">(</span>entry<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>dataMap == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGW<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"create map from entry failed\n"</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">NULL</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>method == <span style="color: #a45bad;">ZipFileRO</span>::kCompressStored<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#25991;&#20214;&#20197;&#23384;&#20648;&#26041;&#24335;&#22312; apk &#20013;&#23384;&#22312;</span>
        pAsset = <span style="color: #a45bad;">Asset</span>::createFromUncompressedMap<span style="color: #2d9574;">(</span>dataMap, mode<span style="color: #2d9574;">)</span>;
        ALOGV<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Opened uncompressed entry %s in zip %s mode %d: %p"</span>, entryName.string<span style="color: #67b11d;">()</span>,
                dataMap-&gt;getFileName<span style="color: #67b11d;">()</span>, mode, pAsset<span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#25991;&#20214;&#20197;&#21387;&#32553;&#26041;&#24335;&#22312; apk &#20013;&#23384;&#22312;</span>
        pAsset = <span style="color: #a45bad;">Asset</span>::createFromCompressedMap<span style="color: #2d9574;">(</span>dataMap, method,
            uncompressedLen, mode<span style="color: #2d9574;">)</span>;
        ALOGV<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Opened compressed entry %s in zip %s mode %d: %p"</span>, entryName.string<span style="color: #67b11d;">()</span>,
                dataMap-&gt;getFileName<span style="color: #67b11d;">()</span>, mode, pAsset<span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>pAsset == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">unexpected */</span>
        ALOGW<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"create from segment failed\n"</span><span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">return</span> pAsset;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
该函数使用 pZipFile-&gt;createEntryFileMap 函数将资源文件数据加载到内存中, 并创建了
FileMap 的对象
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * Create a new FileMap object that spans the data in "entry".</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #ce537a; font-weight: bold;">FileMap</span>* <span style="color: #a45bad;">ZipFileRO</span>::<span style="color: #bc6ec5; font-weight: bold;">createEntryFileMap</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ZipEntryRO</span> <span style="color: #7590db;">entry</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">const</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">_ZipEntryRO</span> *<span style="color: #7590db;">zipEntry</span> = <span style="color: #4f97d7; font-weight: bold;">reinterpret_cast</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">_ZipEntryRO</span>*<span style="color: #bc6ec5;">&gt;(</span>entry<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">ZipEntry</span>&amp; <span style="color: #7590db;">ze</span> = zipEntry-&gt;entry;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">fd</span> = GetFileDescriptor<span style="color: #bc6ec5;">(</span>mHandle<span style="color: #bc6ec5;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">actualLen</span> = <span style="color: #a45bad;">0</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>ze.method == kCompressStored<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        actualLen = ze.uncompressed_length;
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
        actualLen = ze.compressed_length;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #ce537a; font-weight: bold;">FileMap</span>* <span style="color: #7590db;">newMap</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">FileMap</span><span style="color: #bc6ec5;">()</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>newMap-&gt;create<span style="color: #2d9574;">(</span>mFileName, fd, ze.offset, actualLen, <span style="color: #a45bad;">true</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        newMap-&gt;release<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">NULL</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">return</span> newMap;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
从上面的代码中可以看到最终使用 FileMap 的 create 对文件进行创建. 此时需要注意的
是 create 的参数 mFileName是 apk 的名称(
/data/app/example.com.jstest-2/base.apk),并不是 APK 中需要解压的文件的名称.接下
来了解一下FileMap类.FileMap 是什么呢? 我们直接看源码中的解释:
</p>
<div class="org-src-container">
<pre class="src src-C++">/system/core/include/utils/FileMap.h
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * This represents a memory-mapped file.  It might be the entire file or</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * only part of it.  This requires a little bookkeeping because the mapping</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * needs to be aligned on page boundaries, and in some cases we'd like to</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * have multiple references to the mapped area without creating additional</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * maps.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * This always uses MAP_SHARED.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * </span><span style="color: #dc752f;">TODO</span><span style="color: #2aa1ae; background-color: #292e34;">: we should be able to create a new FileMap that is a subset of</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * an existing FileMap and shares the underlying mapped pages.  Requires</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * completing the refcounting stuff and possibly introducing the notion</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * of a FileMap hierarchy.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>
</pre>
</div>
<p>
接下来我们看 FileMap 中的 create 方法的定义:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Create a new mapping on an open file.</span>
<span style="color: #2aa1ae; background-color: #292e34;">//</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Closing the file descriptor does not unmap the pages, so we don't</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">claim ownership of the fd.</span>
<span style="color: #2aa1ae; background-color: #292e34;">//</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Returns "false" on failure.</span>
<span style="color: #ce537a; font-weight: bold;">bool</span> <span style="color: #a45bad;">FileMap</span>::<span style="color: #bc6ec5; font-weight: bold;">create</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">origFileName</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">fd</span>, <span style="color: #ce537a; font-weight: bold;">off64_t</span> <span style="color: #7590db;">offset</span>, <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">length</span>,
        <span style="color: #ce537a; font-weight: bold;">bool</span> <span style="color: #7590db;">readOnly</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
<span style="color: #bc6ec5;">#ifdef</span> HAVE_WIN32_FILEMAP
    <span style="color: #ce537a; font-weight: bold;">int</span>     <span style="color: #7590db;">adjust</span>;
    <span style="color: #ce537a; font-weight: bold;">off64_t</span> <span style="color: #7590db;">adjOffset</span>;
    <span style="color: #ce537a; font-weight: bold;">size_t</span>  <span style="color: #7590db;">adjLength</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mPageSize == -<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #ce537a; font-weight: bold;">SYSTEM_INFO</span>  <span style="color: #7590db;">si</span>;

        GetSystemInfo<span style="color: #2d9574;">(</span> &amp;si <span style="color: #2d9574;">)</span>;
        mPageSize = si.dwAllocationGranularity;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #ce537a; font-weight: bold;">DWORD</span>  <span style="color: #7590db;">protect</span> = readOnly ? PAGE_READONLY : PAGE_READWRITE;

    mFileHandle  = <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">HANDLE</span><span style="color: #bc6ec5;">)</span> _get_osfhandle<span style="color: #bc6ec5;">(</span>fd<span style="color: #bc6ec5;">)</span>;
    mFileMapping = CreateFileMapping<span style="color: #bc6ec5;">(</span> mFileHandle, <span style="color: #a45bad;">NULL</span>, protect, <span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mFileMapping == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"CreateFileMapping(%p, %"</span> PRIx32 <span style="color: #2d9574;">") failed with error %"</span> PRId32 <span style="color: #2d9574;">"\n"</span>,
              mFileHandle, protect, GetLastError<span style="color: #67b11d;">()</span> <span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
    <span style="color: #bc6ec5;">}</span>

    adjust    = offset % mPageSize;
    adjOffset = offset - adjust;
    adjLength = length + adjust;

    mBasePtr = MapViewOfFile<span style="color: #bc6ec5;">(</span> mFileMapping,
                              readOnly ? FILE_MAP_READ : FILE_MAP_ALL_ACCESS,
                              <span style="color: #a45bad;">0</span>,
                              <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">DWORD</span><span style="color: #2d9574;">)(</span>adjOffset<span style="color: #2d9574;">)</span>,
                              adjLength <span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mBasePtr == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"MapViewOfFile(%"</span> PRId64 <span style="color: #2d9574;">", %zu) failed with error %"</span> PRId32 <span style="color: #2d9574;">"\n"</span>,
              adjOffset, adjLength, GetLastError<span style="color: #67b11d;">()</span> <span style="color: #2d9574;">)</span>;
        CloseHandle<span style="color: #2d9574;">(</span>mFileMapping<span style="color: #2d9574;">)</span>;
        mFileMapping = INVALID_HANDLE_VALUE;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
    <span style="color: #bc6ec5;">}</span>
<span style="color: #bc6ec5;">#endif</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22240;&#20026;&#19981;&#26159; window &#31995;&#32479;,&#25152;&#20197;&#36208;&#19979;&#38754;&#30340;&#27969;&#31243;</span>
<span style="color: #bc6ec5;">#ifdef</span> HAVE_POSIX_FILEMAP
    <span style="color: #ce537a; font-weight: bold;">int</span>     <span style="color: #7590db;">prot</span>, <span style="color: #7590db;">flags</span>, <span style="color: #7590db;">adjust</span>;
    <span style="color: #ce537a; font-weight: bold;">off64_t</span> <span style="color: #7590db;">adjOffset</span>;
    <span style="color: #ce537a; font-weight: bold;">size_t</span>  <span style="color: #7590db;">adjLength</span>;

    <span style="color: #ce537a; font-weight: bold;">void</span>* <span style="color: #7590db;">ptr</span>;

    assert<span style="color: #bc6ec5;">(</span>mRefCount == <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>;
    assert<span style="color: #bc6ec5;">(</span>fd &gt;= <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span>;
    assert<span style="color: #bc6ec5;">(</span>offset &gt;= <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span>;
    assert<span style="color: #bc6ec5;">(</span>length &gt; <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">init on first use</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mPageSize == -<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
<span style="color: #bc6ec5;">#if</span> NOT_USING_KLIBC
        mPageSize = sysconf<span style="color: #2d9574;">(</span>_SC_PAGESIZE<span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>mPageSize == -<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            ALOGE<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"could not get _SC_PAGESIZE\n"</span><span style="color: #67b11d;">)</span>;
            <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
        <span style="color: #2d9574;">}</span>
<span style="color: #bc6ec5;">#else</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">this holds for Linux, Darwin, Cygwin, and doesn't pain the ARM</span>
        mPageSize = <span style="color: #a45bad;">4096</span>;
<span style="color: #bc6ec5;">#endif</span>
    <span style="color: #bc6ec5;">}</span>

    adjust   = offset % mPageSize;
<span style="color: #a45bad;">try_again</span>:
    adjOffset = offset - adjust;
    adjLength = length + adjust;

    flags = MAP_SHARED;
    prot = PROT_READ;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>readOnly<span style="color: #bc6ec5;">)</span>
        prot |= PROT_WRITE;

    ptr = mmap<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">NULL</span>, adjLength, prot, flags, fd, adjOffset<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>ptr == MAP_FAILED<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Cygwin does not seem to like file mapping files from an offset.</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">So if we fail, try again with offset zero</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>adjOffset &gt; <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            adjust = offset;
            <span style="color: #4f97d7; font-weight: bold;">goto</span> <span style="color: #a45bad;">try_again</span>;
        <span style="color: #2d9574;">}</span>

        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"mmap(%lld,%zu) failed: %s\n"</span>,
            <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #ce537a; font-weight: bold;">long</span><span style="color: #67b11d;">)</span>adjOffset, adjLength, strerror<span style="color: #67b11d;">(</span>errno<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
    <span style="color: #bc6ec5;">}</span>
    mBasePtr = ptr;
<span style="color: #bc6ec5;">#endif</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">HAVE_POSIX_FILEMAP</span>

    mFileName = origFileName != <span style="color: #a45bad;">NULL</span> ? strdup<span style="color: #bc6ec5;">(</span>origFileName<span style="color: #bc6ec5;">)</span> : <span style="color: #a45bad;">NULL</span>;
    mBaseLength = adjLength;
    mDataOffset = offset;
    mDataPtr = <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">char</span>*<span style="color: #bc6ec5;">)</span> mBasePtr + adjust;
    mDataLength = length;

    assert<span style="color: #bc6ec5;">(</span>mBasePtr != <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;

    ALOGV<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"MAP: base %p/%zu data %p/%zu\n"</span>,
        mBasePtr, mBaseLength, mDataPtr, mDataLength<span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">true</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
通过上面的代码创建完成 FileMap 对象之后,就要返回到openAssetFromZipLocked 方法中,
使用创建的 FileMap 对象创建 Asset 对象,在 openAssetFromFileLocked 中创建 Asset
对象的方法是: Asset::createFromCompressedMap
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">/frameworks/base/libs/androidfw/Asset.cpp</span>
<span style="color: #2aa1ae; background-color: #292e34;">*/</span>
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * Create a new Asset from compressed data in a memory mapping.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #2aa1ae; background-color: #292e34;">/*</span><span style="color: #2aa1ae; background-color: #292e34;">static*/</span> <span style="color: #ce537a; font-weight: bold;">Asset</span>* <span style="color: #a45bad;">Asset</span>::<span style="color: #bc6ec5; font-weight: bold;">createFromCompressedMap</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FileMap</span>* <span style="color: #7590db;">dataMap</span>,
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">method</span>, <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">uncompressedLen</span>, <span style="color: #ce537a; font-weight: bold;">AccessMode</span> <span style="color: #7590db;">mode</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">_CompressedAsset</span>* <span style="color: #7590db;">pAsset</span>;
    <span style="color: #ce537a; font-weight: bold;">status_t</span> <span style="color: #7590db;">result</span>;

    pAsset = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">_CompressedAsset</span>;
    result = pAsset-&gt;openChunk<span style="color: #bc6ec5;">(</span>dataMap, method, uncompressedLen<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>result != NO_ERROR<span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">NULL</span>;

    pAsset-&gt;mAccessMode = mode;
    <span style="color: #4f97d7; font-weight: bold;">return</span> pAsset;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">/frameworks/base/libs/androidfw/Asset.cpp</span>
<span style="color: #2aa1ae; background-color: #292e34;">*/</span>
<span style="color: #ce537a; font-weight: bold;">status_t</span> <span style="color: #a45bad;">_CompressedAsset</span>::<span style="color: #bc6ec5; font-weight: bold;">openChunk</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FileMap</span>* <span style="color: #7590db;">dataMap</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">compressionMethod</span>,
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">uncompressedLen</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    assert<span style="color: #bc6ec5;">(</span>mFd &lt; <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span>;        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">no re-open</span>
    assert<span style="color: #bc6ec5;">(</span>mMap == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;
    assert<span style="color: #bc6ec5;">(</span>dataMap != <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>compressionMethod != <span style="color: #a45bad;">ZipFileRO</span>::kCompressDeflated<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        assert<span style="color: #2d9574;">(</span><span style="color: #a45bad;">false</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> UNKNOWN_ERROR;
    <span style="color: #bc6ec5;">}</span>

    mMap = dataMap;
    mStart = -<span style="color: #a45bad;">1</span>;        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">not used</span>
    mCompressedLen = dataMap-&gt;getDataLength<span style="color: #bc6ec5;">()</span>;
    mUncompressedLen = uncompressedLen;
    assert<span style="color: #bc6ec5;">(</span>mOffset == <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20851;&#38190;&#28857;:</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#38271;&#24230;&#22823;&#20110;64*1024, &#21017;&#21021;&#22987;&#21270; StreamingZipInflater</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>uncompressedLen &gt; <span style="color: #a45bad;">StreamingZipInflater</span>::OUTPUT_CHUNK_SIZE<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        mZipInflater = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">StreamingZipInflater</span><span style="color: #2d9574;">(</span>dataMap, uncompressedLen<span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> NO_ERROR;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
截止到这里,Android 系统已经完成了对资源文件的加载的过程,总结下来就是根据需要加载
的文件的名称,在 APK 中进行创建 zipEntry 进行记载,并构建 Asset 对象.注意如果加载
的文件是以压缩格式存储的(ps:大部分在 apk 中的文件,都是以压缩文件格式存储的),
Asset 对象指向的只是内存中 APK 中的相应的压缩文件的偏移量,长度,压缩后大小以及压
缩前大小等信息,此时*并没有对压缩的数据进行解压缩操作*,这一点尤其需要注意.
</p>
</div>
</div>
