_posts/2019-06-02-android系统加载资源文件源码分析.html


<div id="outline-container-orga636098" class="outline-2">
<h2 id="orga636098">Android 读取资源文件过程分析</h2>
<div class="outline-text-2" id="text-orga636098">
<p>
Android 系统在 AssetManager 类中的 open 等函数返回的是 InputStream,这个
InputStream 其实是 AssetManager 中定义的一个内部类AssetInputStream,这个子类继承了
InputStream 类,并实现了其中的reade 等方法.AssetInputStream中定义的 read 方法的
定义如下:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">frameworks/base/core/java/android/content/res/AssetManager.java</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">read</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">byte</span><span style="color: #bc6ec5;">[]</span> <span style="color: #7590db;">b</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">IOException</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> readAsset<span style="color: #bc6ec5;">(</span>mAsset, b, <span style="color: #a45bad;">0</span>, b.length<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">read</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">byte</span><span style="color: #bc6ec5;">[]</span> <span style="color: #7590db;">b</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">off</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">len</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">IOException</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> readAsset<span style="color: #bc6ec5;">(</span>mAsset, b, off, len<span style="color: #bc6ec5;">)</span>;
</pre>
</div>
<p>
Java 层对readAsset 的定义如下：
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">frameworks/base/core/java/android/content/res/AssetManager.java</span>
<span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">native</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">readAsset</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #7590db;">asset</span>, <span style="color: #ce537a; font-weight: bold;">byte</span><span style="color: #bc6ec5;">[]</span> <span style="color: #7590db;">b</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">off</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">len</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>
<p>
与 Java 层对应的 Native 层的函数的名称是*andorid_content_AssetManager_readAsset*。这个
函数的具体的实现如下：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">frameworks/base/core/jni/android_util_AssetManager.cpp</span>
<span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">jint</span> <span style="color: #bc6ec5; font-weight: bold;">android_content_AssetManager_readAsset</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span>* <span style="color: #7590db;">env</span>, <span style="color: #ce537a; font-weight: bold;">jobject</span> <span style="color: #7590db;">clazz</span>,
                                                <span style="color: #ce537a; font-weight: bold;">jlong</span> <span style="color: #7590db;">assetHandle</span>, <span style="color: #ce537a; font-weight: bold;">jbyteArray</span> <span style="color: #7590db;">bArray</span>,
                                                <span style="color: #ce537a; font-weight: bold;">jint</span> <span style="color: #7590db;">off</span>, <span style="color: #ce537a; font-weight: bold;">jint</span> <span style="color: #7590db;">len</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">assetHandle &#23545;&#24212;&#20110; native &#23618;&#30340; Asset &#31867;&#22411;&#12290;&#26159;&#21542;&#27599;&#20010;&#25991;&#20214;&#37117;&#23545;&#24212;&#20110;&#19968;&#20010; assetHandle &#21602;&#65311;</span>
    <span style="color: #ce537a; font-weight: bold;">Asset</span>* <span style="color: #7590db;">a</span> = <span style="color: #4f97d7; font-weight: bold;">reinterpret_cast</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Asset</span>*<span style="color: #bc6ec5;">&gt;(</span>assetHandle<span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>a == <span style="color: #a45bad;">NULL</span> || bArray == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        jniThrowNullPointerException<span style="color: #2d9574;">(</span>env, <span style="color: #2d9574;">"asset"</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> -<span style="color: #a45bad;">1</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>len == <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #ce537a; font-weight: bold;">jsize</span> <span style="color: #7590db;">bLen</span> = env-&gt;GetArrayLength<span style="color: #bc6ec5;">(</span>bArray<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">off</span> <span style="color: #2d9574;">&lt;</span> <span style="color: #a45bad;">0</span> || off &gt;= bLen || <span style="color: #ce537a; font-weight: bold;">len</span> <span style="color: #67b11d;">&lt;</span> <span style="color: #a45bad;">0</span> || len <span style="color: #67b11d;">&gt;</span> bLen || <span style="color: #67b11d;">(</span>off+len<span style="color: #67b11d;">)</span> <span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">bLen</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        jniThrowException<span style="color: #2d9574;">(</span>env, <span style="color: #2d9574;">"java/lang/IndexOutOfBoundsException"</span>, <span style="color: #2d9574;">""</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> -<span style="color: #a45bad;">1</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #ce537a; font-weight: bold;">jbyte</span>* <span style="color: #7590db;">b</span> = env-&gt;GetByteArrayElements<span style="color: #bc6ec5;">(</span>bArray, <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20851;&#38190;&#20195;&#30721;&#65292;&#35843;&#29992; Asset &#30340; read &#20989;&#25968;&#23545;APK &#20013;&#30340;&#36164;&#28304;&#36827;&#34892;&#35835;&#21462;</span>
    <span style="color: #ce537a; font-weight: bold;">ssize_t</span> <span style="color: #7590db;">res</span> = a-&gt;read<span style="color: #bc6ec5;">(</span>b+off, len<span style="color: #bc6ec5;">)</span>;
    env-&gt;ReleaseByteArrayElements<span style="color: #bc6ec5;">(</span>bArray, b, <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>res &gt; <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">static_cast</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">jint</span><span style="color: #bc6ec5;">&gt;(</span>res<span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>res &lt; <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        jniThrowException<span style="color: #2d9574;">(</span>env, <span style="color: #2d9574;">"java/io/IOException"</span>, <span style="color: #2d9574;">""</span><span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> -<span style="color: #a45bad;">1</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
Asset类的 read 函数的实现如下：
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">frameworks/base/libs/androidfw/Asset.cpp</span>
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * Read data from a chunk of compressed data.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * [For now, that's just copying data out of a buffer.]</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #ce537a; font-weight: bold;">ssize_t</span> <span style="color: #a45bad;">_CompressedAsset</span>::<span style="color: #bc6ec5; font-weight: bold;">read</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span>* <span style="color: #7590db;">buf</span>, <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">count</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">maxLen</span>;
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">actual</span>;

    assert<span style="color: #bc6ec5;">(</span>mOffset &gt;= <span style="color: #a45bad;">0</span> &amp;&amp; mOffset &lt;= mUncompressedLen<span style="color: #bc6ec5;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">If we're relying on a streaming inflater, go through that */</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#25991;&#20214;&#35299;&#21387;&#32553;&#21518;&#30340;&#38271;&#24230;&#22823;&#20110;StreamingZipInflater::OUTPUT_CHUNK_SIZE&#65288;64*1024&#65289;&#65292;mZipInflaget &#30340;&#20540;&#23601;&#19981;&#20250;&#20026;&#31354;&#12290;</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mZipInflater<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20851;&#38190;&#20989;&#25968;: read</span>
        actual = mZipInflater-&gt;read<span style="color: #2d9574;">(</span>buf, count<span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#25991;&#20214;&#35299;&#21387;&#32553;&#21518;&#30340;&#38271;&#24230;&#23567;&#20110; 64*1024&#65292;&#23601;&#20250;&#36208;&#19979;&#38754;&#30340;&#27969;&#31243;</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>mBuf == <span style="color: #a45bad;">NULL</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20851;&#38190;&#20989;&#25968;: getBuffer</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>getBuffer<span style="color: #b1951d;">(</span><span style="color: #a45bad;">false</span><span style="color: #b1951d;">)</span> == <span style="color: #a45bad;">NULL</span><span style="color: #67b11d;">)</span>
                <span style="color: #4f97d7; font-weight: bold;">return</span> -<span style="color: #a45bad;">1</span>;
        <span style="color: #2d9574;">}</span>
        assert<span style="color: #2d9574;">(</span>mBuf != <span style="color: #a45bad;">NULL</span><span style="color: #2d9574;">)</span>;

        <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">adjust count if we're near EOF */</span>
        maxLen = mUncompressedLen - mOffset;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>count &gt; maxLen<span style="color: #2d9574;">)</span>
            count = maxLen;

        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span><span style="color: #a45bad;">!</span>count<span style="color: #2d9574;">)</span>
            <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;

        <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">copy from buffer */</span>
        <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">printf("comp buf read\n");</span>
        memcpy<span style="color: #2d9574;">(</span>buf, <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">char</span>*<span style="color: #67b11d;">)</span>mBuf + mOffset, count<span style="color: #2d9574;">)</span>;
        actual = count;
    <span style="color: #bc6ec5;">}</span>

    mOffset += actual;
    <span style="color: #4f97d7; font-weight: bold;">return</span> actual;
<span style="color: #4f97d7;">}</span>

</pre>
</div>
<p>
mZipInflater 的类型为 StreamingZipInflater，StreamZipInflater 中的 read 的定义如
下：
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">frameworks/base/include/androidfw/StreamingZipInflater.h</span>
<span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">android</span> <span style="color: #4f97d7;">{</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">StreamingZipInflater</span> <span style="color: #bc6ec5;">{</span>
<span style="color: #4f97d7; font-weight: bold;">public</span>:
    <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">INPUT_CHUNK_SIZE</span> = <span style="color: #a45bad;">64</span> * <span style="color: #a45bad;">1024</span>;
    <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">OUTPUT_CHUNK_SIZE</span> = <span style="color: #a45bad;">64</span> * <span style="color: #a45bad;">1024</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Flavor that pages in the compressed data from a fd</span>
    <span style="color: #bc6ec5; font-weight: bold;">StreamingZipInflater</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">fd</span>, <span style="color: #ce537a; font-weight: bold;">off64_t</span> <span style="color: #7590db;">compDataStart</span>, <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">uncompSize</span>, <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">compSize</span><span style="color: #2d9574;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Flavor that gets the compressed data from an in-memory buffer</span>
    <span style="color: #bc6ec5; font-weight: bold;">StreamingZipInflater</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">FileMap</span>* <span style="color: #7590db;">dataMap</span>, <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">uncompSize</span><span style="color: #2d9574;">)</span>;

    ~<span style="color: #bc6ec5; font-weight: bold;">StreamingZipInflater</span><span style="color: #2d9574;">()</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">read 'count' bytes of uncompressed data from the current position.  outBuf may</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">be NULL, in which case the data is consumed and discarded.</span>
    <span style="color: #ce537a; font-weight: bold;">ssize_t</span> <span style="color: #bc6ec5; font-weight: bold;">read</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">void</span>* <span style="color: #7590db;">outBuf</span>, <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">count</span><span style="color: #2d9574;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">seeking backwards requires uncompressing fom the beginning, so is very</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">expensive.  seeking forwards only requires uncompressing from the current</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">position to the destination.</span>
    <span style="color: #ce537a; font-weight: bold;">off64_t</span> <span style="color: #bc6ec5; font-weight: bold;">seekAbsolute</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">off64_t</span> <span style="color: #7590db;">absoluteInputPosition</span><span style="color: #2d9574;">)</span>;
<span style="color: #4f97d7; font-weight: bold;">private</span>:
    <span style="color: #2aa1ae; background-color: #292e34;">//  </span><span style="color: #2aa1ae; background-color: #292e34;">StreamingZipInflater&#20013;&#23450;&#20041;&#30340;&#25968;&#25454;&#32467;&#26500;&#65292;&#36825;&#20123;&#25968;&#25454;&#32467;&#26500;&#29992;&#26469;</span>
    <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">initInflateState</span><span style="color: #2d9574;">()</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">readNextChunk</span><span style="color: #2d9574;">()</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">where to find the uncompressed data</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">mFd</span>;
    <span style="color: #ce537a; font-weight: bold;">off64_t</span> <span style="color: #7590db;">mInFileStart</span>;         <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">where the compressed data lives in the file</span>
    <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">FileMap</span>* <span style="color: #7590db;">mDataMap</span>;

    <span style="color: #ce537a; font-weight: bold;">z_stream</span> <span style="color: #7590db;">mInflateState</span>;
    <span style="color: #ce537a; font-weight: bold;">bool</span> <span style="color: #7590db;">mStreamNeedsInit</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">output invariants for this asset</span>
    <span style="color: #ce537a; font-weight: bold;">uint8_t</span>* <span style="color: #7590db;">mOutBuf</span>;           <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">output buf for decompressed bytes</span>
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">mOutBufSize</span>;         <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">allocated size of mOutBuf</span>
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">mOutTotalSize</span>;       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">total uncompressed size of the blob</span>

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">current output state bookkeeping</span>
    <span style="color: #ce537a; font-weight: bold;">off64_t</span> <span style="color: #7590db;">mOutCurPosition</span>;      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">current position in total offset</span>
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">mOutLastDecoded</span>;     <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">last decoded byte + 1 in mOutbuf</span>
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">mOutDeliverable</span>;     <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">next undelivered byte of decoded output in mOutBuf</span>

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">input invariants</span>
    <span style="color: #ce537a; font-weight: bold;">uint8_t</span>* <span style="color: #7590db;">mInBuf</span>;
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">mInBufSize</span>;          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">allocated size of mInBuf;</span>
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">mInTotalSize</span>;        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">total size of compressed data for this blob</span>

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">input state bookkeeping</span>
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">mInNextChunkOffset</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">offset from start of blob at which the next input chunk lies</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">the z_stream contains state about input block consumption</span>
<span style="color: #bc6ec5;">}</span>;


<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">frameworks/base/libs/androidfw/StreamingZipInflater.cpp</span>
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * Basic approach:</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * 1. If we have undelivered uncompressed data, send it.  At this point</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    either we've satisfied the request, or we've exhausted the available</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    output data in mOutBuf.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * 2. While we haven't sent enough data to satisfy the request:</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    0. if the request is for more data than exists, bail.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    a. if there is no input data to decode, read some into the input buffer</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *       and readjust the z_stream input pointers</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    b. point the output to the start of the output buffer and decode what we can</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *    c. deliver whatever output data we can</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #ce537a; font-weight: bold;">ssize_t</span> <span style="color: #a45bad;">StreamingZipInflater</span>::<span style="color: #bc6ec5; font-weight: bold;">read</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">void</span>* <span style="color: #7590db;">outBuf</span>, <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">count</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">uint8_t</span>* <span style="color: #7590db;">dest</span> = <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">uint8_t</span>*<span style="color: #2d9574;">)</span> outBuf;
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">bytesRead</span> = <span style="color: #a45bad;">0</span>;
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">toRead</span> = min_of<span style="color: #2d9574;">(</span>count, size_t<span style="color: #67b11d;">(</span>mOutTotalSize - mOutCurPosition<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #2d9574;">(</span>toRead &gt; <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">First, write from whatever we already have decoded and ready to go</span>
        <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">deliverable</span> = min_of<span style="color: #67b11d;">(</span>toRead, mOutLastDecoded - mOutDeliverable<span style="color: #67b11d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>deliverable &gt; <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#31532;&#19968;&#27425;&#19981;&#25191;&#34892;&#65292;&#31561;&#21040;&#21518;&#38754;&#22312;&#25191;&#34892;&#65292;&#35201;&#20808;&#31561;&#21518;&#38754; inflate &#26041;&#27861;&#25191;&#34892;&#20043;&#21518;&#25165;&#20250;&#25191;&#34892;</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>outBuf != <span style="color: #a45bad;">NULL</span><span style="color: #b1951d;">)</span> memcpy<span style="color: #b1951d;">(</span>dest, mOutBuf + mOutDeliverable, deliverable<span style="color: #b1951d;">)</span>;
            mOutDeliverable += deliverable;
            mOutCurPosition += deliverable;
            dest += deliverable;
            bytesRead += deliverable;
            toRead -= deliverable;
        <span style="color: #67b11d;">}</span>

        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">need more data?  time to decode some.</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>toRead &gt; <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">if we don't have any data to decode, read some in.  If we're working</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">from mmapped data this won't happen, because the clipping to total size</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">will prevent reading off the end of the mapped input chunk.</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span>mInflateState.avail_in == <span style="color: #a45bad;">0</span><span style="color: #4f97d7;">)</span> &amp;&amp; <span style="color: #4f97d7;">(</span>mDataMap == <span style="color: #a45bad;">NULL</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
                <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">err</span> = readNextChunk<span style="color: #4f97d7;">()</span>;
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>err &lt; <span style="color: #a45bad;">0</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
                    ALOGE<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Unable to access asset data: %d"</span>, err<span style="color: #bc6ec5;">)</span>;
                    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>mStreamNeedsInit<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
                        ::inflateEnd<span style="color: #2d9574;">(</span>&amp;mInflateState<span style="color: #2d9574;">)</span>;
                        initInflateState<span style="color: #2d9574;">()</span>;
                    <span style="color: #bc6ec5;">}</span>
                    <span style="color: #4f97d7; font-weight: bold;">return</span> -<span style="color: #a45bad;">1</span>;
                <span style="color: #4f97d7;">}</span>
            <span style="color: #b1951d;">}</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">we know we've drained whatever is in the out buffer now, so just</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">start from scratch there, reading all the input we have at present.</span>
            mInflateState.next_out = <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">Bytef</span>*<span style="color: #b1951d;">)</span> mOutBuf;
            mInflateState.avail_out = mOutBufSize;

            <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">            ALOGV("Inflating to outbuf: avail_in=%u avail_out=%u next_in=%p next_out=%p",</span>
<span style="color: #2aa1ae; background-color: #292e34;">                    mInflateState.avail_in, mInflateState.avail_out,</span>
<span style="color: #2aa1ae; background-color: #292e34;">                    mInflateState.next_in, mInflateState.next_out);</span>
<span style="color: #2aa1ae; background-color: #292e34;">            */</span>
            <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">result</span> = Z_OK;
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>mStreamNeedsInit<span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
                ALOGV<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Initializing zlib to inflate"</span><span style="color: #4f97d7;">)</span>;
                result = inflateInit2<span style="color: #4f97d7;">(</span>&amp;mInflateState, -MAX_WBITS<span style="color: #4f97d7;">)</span>;
                mStreamNeedsInit = <span style="color: #a45bad;">false</span>;
            <span style="color: #b1951d;">}</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20851;&#38190;&#20195;&#30721;&#65292; Zlib &#24211;&#20013;&#30340;&#20989;&#25968;&#65292;&#29992;&#26469;&#20174; APK &#20013;&#35299;&#21387;&#32553;&#20869;&#23384;&#25968;&#25454;</span>
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#31532;&#19968;&#27425;&#25191;&#34892;&#30340;&#26102;&#20505;&#65292;&#37117;&#20250;&#20248;&#20808;&#36208;&#21040;&#36825;&#19968;&#27493;&#20013;&#26469;</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>result == Z_OK<span style="color: #b1951d;">)</span> result = ::inflate<span style="color: #b1951d;">(</span>&amp;mInflateState, Z_SYNC_FLUSH<span style="color: #b1951d;">)</span>;
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>result &lt; <span style="color: #a45bad;">0</span><span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
                <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Whoops, inflation failed</span>
                ALOGE<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Error inflating asset: %d"</span>, result<span style="color: #4f97d7;">)</span>;
                ::inflateEnd<span style="color: #4f97d7;">(</span>&amp;mInflateState<span style="color: #4f97d7;">)</span>;
                initInflateState<span style="color: #4f97d7;">()</span>;
                <span style="color: #4f97d7; font-weight: bold;">return</span> -<span style="color: #a45bad;">1</span>;
            <span style="color: #b1951d;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #b1951d;">{</span>
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>result == Z_STREAM_END<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
                    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">we know we have to have reached the target size here and will</span>
                    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">not try to read any further, so just wind things up.</span>
                    ::inflateEnd<span style="color: #bc6ec5;">(</span>&amp;mInflateState<span style="color: #bc6ec5;">)</span>;
                <span style="color: #4f97d7;">}</span>

                <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Note how much data we got, and off we go</span>
                mOutDeliverable = <span style="color: #a45bad;">0</span>;
                mOutLastDecoded = mOutBufSize - mInflateState.avail_out;
            <span style="color: #b1951d;">}</span>
        <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> bytesRead;
<span style="color: #bc6ec5;">}</span>
</pre>
</div>
<p>
上面 read 方法实现了对资源文件的解压缩操作.以上的操作只是针对解压缩长度大于
64*1024的文件,如果文件的解压缩的长度小于64 *1024, 则在_CompressedAsset::read 方
法中,会调用 getBuffer 操作, getBuffer 源码如下所示:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">location: /frameworks/base/libs/androidfw/Asset.cpp</span>
<span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * Get a pointer to a read-only buffer of data.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> *</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * The first time this is called, we expand the compressed data into a</span>
<span style="color: #2aa1ae; background-color: #292e34;"> * buffer.</span>
<span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">void</span>* <span style="color: #a45bad;">_CompressedAsset</span>::<span style="color: #bc6ec5; font-weight: bold;">getBuffer</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">bool</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">unsigned</span> <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">buf</span> = <span style="color: #a45bad;">NULL</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mBuf != <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> mBuf;

    <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * Allocate a buffer and read the file into it.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     */</span>
    buf = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">unsigned</span> <span style="color: #ce537a; font-weight: bold;">char</span><span style="color: #bc6ec5;">[</span>mUncompressedLen<span style="color: #bc6ec5;">]</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>buf == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGW<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"alloc %ld bytes failed\n"</span>, <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">long</span><span style="color: #67b11d;">)</span> mUncompressedLen<span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">goto</span> <span style="color: #a45bad;">bail</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mMap != <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20851;&#38190;&#20989;&#25968;: &#35843;&#29992; zipUtils &#20013;&#30340;&#25805;&#20316;&#36827;&#34892;&#35299;&#21387;&#25805;&#20316;</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span><span style="color: #a45bad;">!</span><span style="color: #a45bad;">ZipUtils</span>::inflateToBuffer<span style="color: #67b11d;">(</span>mMap-&gt;getDataPtr<span style="color: #b1951d;">()</span>, buf,
                mUncompressedLen, mCompressedLen<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
            <span style="color: #4f97d7; font-weight: bold;">goto</span> <span style="color: #a45bad;">bail</span>;
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
        assert<span style="color: #2d9574;">(</span>mFd &gt;= <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span>;

        <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">         * Seek to the start of the compressed data.</span>
<span style="color: #2aa1ae; background-color: #292e34;">         */</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>lseek<span style="color: #67b11d;">(</span>mFd, mStart, SEEK_SET<span style="color: #67b11d;">)</span> != mStart<span style="color: #2d9574;">)</span>
            <span style="color: #4f97d7; font-weight: bold;">goto</span> <span style="color: #a45bad;">bail</span>;

        <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">         * Expand the data into it.</span>
<span style="color: #2aa1ae; background-color: #292e34;">         */</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span><span style="color: #a45bad;">!</span><span style="color: #a45bad;">ZipUtils</span>::inflateToBuffer<span style="color: #67b11d;">(</span>mFd, buf, mUncompressedLen,
                mCompressedLen<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
            <span style="color: #4f97d7; font-weight: bold;">goto</span> <span style="color: #a45bad;">bail</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * Success - now that we have the full asset in RAM we</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * no longer need the streaming inflater</span>
<span style="color: #2aa1ae; background-color: #292e34;">     */</span>
    <span style="color: #4f97d7; font-weight: bold;">delete</span> mZipInflater;
    mZipInflater = <span style="color: #a45bad;">NULL</span>;

    mBuf = buf;
    buf = <span style="color: #a45bad;">NULL</span>;

<span style="color: #a45bad;">bail</span>:
    <span style="color: #4f97d7; font-weight: bold;">delete</span><span style="color: #bc6ec5;">[]</span> buf;
    <span style="color: #4f97d7; font-weight: bold;">return</span> mBuf;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
