_org/android系统加载资源文件源码分析.org
* 参考连接
1.[[http://www.tasfa.cn/index.php/2017/09/22/android-assets_sourcecode/][Android Assets打开调用过程源码分析 | Tasfa's world]]
 


