_posts/2019-06-02-android系统加载资源文件源码分析.html




<div id="outline-container-orge4e2525" class="outline-2">
<h2 id="orge4e2525">参考连接</h2>
<div class="outline-text-2" id="text-orge4e2525">
<p>
1.<a href="http://www.tasfa.cn/index.php/2017/09/22/android-assets_sourcecode/">Android Assets打开调用过程源码分析 | Tasfa's world</a>
</p>
</div>
</div>
